GlomarGadaffi/t-mixrf-idf/sdkconfig.defaults
# Target
CONFIG_IDF_TARGET="esp32s3"

# CPU
CONFIG_ESP32S3_DEFAULT_CPU_FREQ_MHZ_240=y

# Flash — ESP32-S3-WROOM-1-N16R8 has 16 MB QIO flash
CONFIG_ESPTOOLPY_FLASHSIZE_16MB=y
CONFIG_ESPTOOLPY_FLASH_MODE_QIO=y
CONFIG_ESPTOOLPY_FLASH_FREQUENCY_80M=y
CONFIG_PARTITION_TABLE_CUSTOM=y
CONFIG_PARTITION_TABLE_CUSTOM_FILENAME="partitions.csv"

# PSRAM — GPIO33-37 are wired to radio module CS/RST/BUSY pins on this board.
# Enabling PSRAM locks those GPIOs to the OPI PSRAM controller, breaking SPI comms.
CONFIG_SPIRAM=n

# Logging
CONFIG_LOG_DEFAULT_LEVEL_INFO=y
CONFIG_LOG_COLORS=y

# Main task stack — give it room for SPI + printf
CONFIG_ESP_MAIN_TASK_STACK_SIZE=8192

# FreeRTOS tick rate
CONFIG_FREERTOS_HZ=1000

# USB console (WROOM uses USB-OTG CDC on GPIO19/20 as default UART)
CONFIG_ESP_CONSOLE_USB_CDC=y
